Repository: 84000/translation-memory-resources
Catalog: post_input/toh70.bo.en.tmx
Source language: bo
Languages: en

source: དུས་ དུས་ སུ འམ །_ ཅུང་ཟད་ [164a] ཅུང་ཟད་ དུ་ ཡང་ མི་ བཟོད་པ་ དང་ །_ ཇི་སྙམ་ པར་ མི་ བྱེད་པ་ སྤང་བ་ དང་ །_ དོར་བ་ དང་ །_ བསལ་བ ར་ སྩོལ་ ལོ །_། འབད་ དོ །_།
en: From time to time, or little [164.a] by little, they strive and exert themselves in abandoning, forsaking, and eliminating their lack of patience and acquiescence.

source: དུས་ དུས་ སུ་ འམ །_ ཅུང་ཟད་ ཅུང་ཟད་ དུ་ ཡང་ བཟོད་པ་ དང་ །_ ཇི་ མི་ སྙམ་པ་ ལ་ སློབ་པ་ དང་ །_ མངོན་པར་ འཕེལ་བ ར་ བྱ་བ་ དང་ །_ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ་ སྩོལ་ ལོ །_། འབད་ དོ །_།
en: From time to time, or little by little, they also strive and exert themselves in training, developing, and perfecting their patience and acquiescence.

source: ལག་ བཟངས་ བྱང་ཆུབ་ སེམས་དཔའ་ རྣམས་ ཀྱི་ བྱང་ཆུབ་ ཏུ་ སེམས་བསྐྱེད་པ་ དང་ །_ |#| བྱང་ཆུབ་ ཀྱི་ སེམས་ རྗེས་སུ་ དྲན་པ་ དང་ །_ བྱང་ཆུབ་ ཀྱི་ སེམས་ སྒོམ་པ་ དང་ །_ |#| བྱང་ཆུབ་ ཏུ་ སྨོན་པ་ དང་ །_ བྱང་ཆུབ་ ཏུ་ སྨོན་ལམ་ འདེབས་པ་ གང་ཡིན་པ་ དེ་ཉིད་ དེ་དག་ གི་ བཟོད་པ་ ཀུན་ ཏུ་ སྤྱོད་པ་ དགེ་བ་ དང་ །_ བཟོད་པ་ ཡང་དག་ པར་ བསྒྲུབ་པ་ དགེ་བ་ གྲངས་མེད་ ཅིང་ དཔག་ ཏུ་ མེད་པ་ ཡིན་ ནོ །_།
en: Subāhu, bodhisattvas’ formation of the resolve set on awakening, |#| their recollection and cultivation of the resolve for awakening, and their wishes and aspirations for awakening are themselves the bodhisattvas’ immeasurable and incalculable virtues of practicing and truly accomplishing patience.

source: འདི་ལྟ་སྟེ །_ |#| འཇིག་རྟེན་ གྱི་ ཁམས་ ཐམས་ཅད་ དུ་ སེམས་ཅན་ ཐམས་ཅད་ ལ་ ཟག་པ་ མེད་པ འི་ བཟོད་པ་ བསྐྱེད་པ ར་ འདོད་པ་ དང་ །_ མི་སློབ་པ འི་ བཟོད་པ་ བསྐྱེད་པ ར་ འདོད་པ་ དང་ །_ ཟག་པ་ མེད་པ འི་ བཟོད་པ་ ཡང་དག་ པར་ བསྐྱེད་པ ར་ འདོད་པ་ དང་ །_ མི་སློབ་པ འི་ བཟོད་པ་ ཡང་དག་ པར་ བསྐྱེད་པ ར་ འདོད་པ་ དེ་ ནི་ བཟོད་པ་ ཀུན་ ཏུ་ སྤྱོད་པ་ དགེ་བ་ དང་ །_ བཟོད་པ་ ཡང་དག་ པར་ སྒྲུབ་པ་ དགེ་བ་ ཐམས་ཅད་ ཀྱི་ མཆོག་ ཡིན་ ནོ །_། དེ་ ནི་ དམ་པ་ ཡིན་ ནོ །_།
en: It is because among all the virtues of practicing and truly accomplishing patience, foremost and supreme is the wish to engender undefiled patience and patience at the level of no-more-training, and to do so perfectly, in all beings throughout all world systems.

source: ལག་ བཟངས་ དེ་ལྟ ར་ ན་ བྱང་ཆུབ་ སེམས་དཔའ་ བདེ་བ་ དང་ ལྡན་ ལ་ ཡིད་ བདེ་བ་ དང་ ལྡན་ ཞིང་ ཚེགས་ ཆུང་ངུ་ དང་ །_ སྡུག་བསྔལ་ ཆུང་ངུ ས་ མྱུར་ དུ་ སྐྱེན་པ ར་ བཟོད་པ འི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱེད་ དོ །_།
en: $48 “Subāhu, in this way bodhisattvas very quickly complete the perfection of patience with ease and pleasure, little difficulty, and little pain.”

source: ལག་ བཟངས་ བྱང་ཆུབ་ སེམས་དཔའ་ ཇི་ལྟ ར་ བརྩོན་འགྲུས་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱེད་ ཅེ་ན །_
en: $49 “Subāhu, how do bodhisattvas complete the perfection of diligence?

source: ལག་ བཟངས་ འདི་ ལ་ བྱང་ཆུབ་ སེམས་དཔའ་ འདི་ལྟར་ ཡང་དག་ པར་ སློབ་ སྟེ །_
en: Subāhu, bodhisattvas properly train in this by thinking as follows:

source: ཕྱོགས་ བཅུ འི་ ཕྱོགས་ རེ་རེ ར་ ཡང་ འཇིག་རྟེན་ གྱི་ ཁམས་ མཐའ་ ཡ ས་ མུ་མེད་ དེ །_ འཇིག་རྟེན་ གྱི་ ཁམས་ རེ་རེ་ ན་ ཡང་ སེམས་ཅན་ མཐའ་ ཡ ས་ སོ །_།
en: ‘In each of the ten directions, there are infinite and limitless world systems, and in each of these world systems there are infinite beings.

source: དེ་ལྟ ར་ སེམས་ཅན་ གྱི་ ཚོགས་ མཐའ་ ཡ ས་ ཤིང་ མུ་མེད་པ་ ལ་ མཐའ་ ཡོད་པ་ མ་ ཡིན་ མུ་ ཡོད་པ་ མ་ ཡིན་ ཏེ །_
en: Thus, this infinite and limitless multitude of beings has neither limit nor end.

source: བདག་ ནི་ སེམས་ཅན་ གྱི་ ཚོགས་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ དེ་ ལ་ ཕན་པ འི་ ཕྱིར་ གོ་ཆ་ བགོས་ [164b] ལ །_
en: I shall don armor to benefit this infinite multitude of beings. [164.b]

source: སེམས་ཅན་ གྱི་ ཚོགས་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ ལ་ བདེ་བ འི་ ཕྱིར་ གོ་ཆ་ བགོས་ ན་
en: If I don armor to bring happiness to the infinite multitude of beings,

source: སེམས་ཅན་ ཐམས་ཅད་ ལ་ ཕན་པ ར་ དམིགས་པ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ ལ་ བདེ་བ ར་ དམིགས་པ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ འི་ དགེ་བ འི་ རྩ་བ་ མཐའ་ཡས་པ་ དག་ བག་མེད་ པར་ གྱུར་ ཏམ །_ |#| སེམས་ གཞན་ དུ་ གྱུར་ ཏམ །_ གཉིད་ ཀྱིས་ ལོག་ ཀྱང་ ཉིན་མཚན་ དུ་ སེམས་ ཀྱི་ སྐད་ཅིག་ སེམས་ ཀྱི་ སྐད་ཅིག་ ལ་ འཕེལ་བ་ དང་ །_ རྒྱས་པ་ དང་ །_ ཡོངས་སུ་ རྫོགས་པ ར་ འགྱུར་ ཏེ
en: then even when I am careless, distracted, or asleep, |#| the infinite roots of virtue from the infinite goal of benefiting and bringing happiness to all beings will grow, expand, and be perfected#24 in each and every moment of thought, throughout the day and night.

source: སེམས་ ཀྱི་ སྐད་ཅིག་ སེམས་ ཀྱི་ སྐད་ཅིག་ ལ་ དགེ་བ འི་ རྩ་བ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ དག་ སྐྱེ་བ་ དང་ །_ བྱང་ཆུབ་ ཀྱི་ ཚོགས་ ཀྱི་ ཕུང་པོ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ དག་ སྐྱེ་བ ས་ རྫོགས་པ འི་ བྱང་ཆུབ་ རྙེད་ དཀའ་བ ར་ མི་ འགྱུར་ ན་
en: Thus, since in each and every moment of thought there will arise infinite roots of virtue and infinite heaps of accumulations conducive to awakening, it will not be difficult to obtain perfect awakening.

source: བདག་ གིས་ འདིར་ སེམས་ ཀྱི་ སྐད་ཅིག་ སེམས་ ཀྱི་ སྐད་ཅིག་ ལ་ དགེ་བ འི་ རྩ་བ་ འཕེལ་བ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ དང་ །_ |#| དགེ་བ འི་ རྩ་བ་ རྒྱས་པ ར་ འགྱུར་བ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ ཡང་དག་ པར་ རྗེས་སུ་ མཐོང་ ལ་
en: That being the case, I shall now sincerely tend to the infinite growth and expansion of these roots of virtue in each and every moment of thought.

source: གཞི་ དེ་ལས་ རྫོགས་པ འི་ བྱང་ཆུབ་ རྙེད་ མི་ དཀའ་བ ར་ ཡང་དག་ པར་ རྗེས་སུ་ མཐོང་ བཞིན་ དུ་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཐོབ་པ ར་ འགྱུར་བ འི་ བརྩོན་འགྲུས་ སྲོག་ གི་ ཕྱིར་ཡང་ ཅིའི་ཕྱིར་ ཉམས་པ ར་ བྱ་ སྙམ་ མོ །_།
en: On that basis, I will ensure that perfect awakening will not be difficult to obtain. In so doing, why would I slacken my diligence, even at the cost of my own life, when it enables me to attain perfect awakening?’

source: གང་ཞིག་ སེམས་ཅན་ གྱི་ ཚོགས་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ དེ འི་ རྒ་བ འི་ སྡུག་བསྔལ་ གཅིག་པུ་ བསལ་བ་ དང་ གཞོམ་པ ར་ འདོད་པ་ དེ་ཡང་ སེམས་ ཀྱི་ སྐད་ཅིག་ སེམས་ ཀྱི་ སྐད་ཅིག་ ལ་ དགེ་བ འི་ རྩ་བ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ འཕེལ་ ལ །_ དགེ་བ འི་ རྩ་བ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ རྒྱས་པ ར་ འགྱུར་ ན
en: ‘Even those who wish to eliminate and overcome only the suffering of aging on behalf of the infinite multitude of beings will have roots of virtue grow and expand in each and every moment of thought.

source: གང་ཞིག་ སེམས་ཅན་ གྱི་ ཚོགས་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ དེ འི་ སྐྱེ་བ འི་ སྡུག་བསྔལ་ དང་ །_ འཆི་བ འི་ སྡུག་བསྔལ་ བསལ་བ ར་ འདོད་པ་ དང་ །_ |#| སྡུག་པ་ དང་ བྲལ་བ འི་ སྡུག་བསྔལ་ དང་ །_ མི་ སྡུག་པ་ དང་ ཕྲད་པ འི་ སྡུག་བསྔལ་ དང་ །_ |#| འདོད་པ་ མི་ འབྱོར་བ འི་ སྡུག་བསྔལ་ དང་ །_ |#| དུད་འགྲོ འི་ སྐྱེ་གནས་ ཀྱི་ སྡུག་བསྔལ་ དང་ །_ |#| གཤིན་རྗེ འི་ འཇིག་རྟེན་ གྱི་ སྡུག་བསྔལ་ དང་ །_ |#| སེམས་ཅན་ དམྱལ་བ འི་ སྡུག་བསྔལ་ དང་ །_ |#| གྲང་བ འི་ སེམས་ཅན་ དམྱལ་བ འི་ སྡུག་བསྔལ་ དང་ །_ ཚ་བ འི་ སེམས་ཅན་ དམྱལ་བ འི་ སྡུག་ [165a] བསྔལ་ བསལ་བ ར་ འདོད་པ་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ དགོས་ སྙམ་ མོ །_།
en: Such being the case, how much more so will that be the case for those who wish to eliminate the infinite multitude of beings’ suffering of birth and death, |#| their suffering of being separated from what they like and encountering what they dislike, |#| their suffering of not acquiring what they want, |#| the suffering of animal births and |#| Yama’s world, and |#| the suffering of the hells, |#| the cold hells, and the hot hells?’ [165.a]

source: གང་ཞིག་ སེམས་ཅན་ གྱི་ ཚོགས་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ དེ འི་ སྡུག་བསྔལ་ སེམས་ ཀྱི་ སྐད་ཅིག་ གཅིག་པ འི་ སེམས་ ཀྱི་ སྐད་ཅིག་ གཅིག་ ཙམ་ དང་ འབྲེལ་བ་ བསལ་བ ར་ འདོད་པ་ དེ་ཡང་ སེམས་ ཀྱི་ སྐད་ཅིག་ སེམས་ ཀྱི་ སྐད་ཅིག་ ལ་ དགེ་བ འི་ རྩ་བ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ འཕེལ་ ལ །_ དགེ་བ འི་ རྩ་བ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ རྒྱས་པ ར་ འགྱུར་ ན
en: ‘Even those who wish to eliminate the infinite multitude of beings’ suffering for just a single moment of thought will have infinite roots of virtue grow and expand in each and every moment of thought.

source: གང་ཞིག་ མ་འོངས་ ཤིང་ མ་ ཕྱིན་པ འི་ བསྐལ་པ་ མཐའ་ ཡ ས་ དཔག་ ཏུ་ མེད་པ་ རྣམས་ སུ་ སེམས་ཅན་ གྱི་ ཚོགས་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ དེ འི་ སྐྱེ་བ འི་ སྡུག་བསྔལ་ ནས་ སྲིད་པ འི་ སྡུག་བསྔལ་ གྱི་ བར་ དུ་ བསལ་བ ར་ འདོད་པ་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ དགོས་ སྙམ་ མོ །_།
en: Such being the case, how much more so will that be the case for those who wish to eliminate all the suffering—from the suffering of birth up to that of becoming#25—of the infinite multitude of beings throughout the infinite and immeasurable eons that have yet to come and go?’

source: གང་ཞིག་ རང་ སངས་རྒྱས་ ཀྱི་ ཡོན་ཏན་ ནམ །_ ཉན་ཐོས་ ཀྱི་ ཡོན་ཏན་ འདོད་པ་ དེ་ཡང་ སེམས་ ཀྱི་ སྐད་ཅིག་ སེམས་ ཀྱི་ སྐད་ཅིག་ ལ་ དགེ་བ འི་ རྩ་བ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ འཕེལ་ ལ །_ དགེ་བ འི་ རྩ་བ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ རྒྱས་པ ར་ འགྱུར་ ན
en: ‘Even those who wish for the qualities of a solitary buddha or a hearer will have roots of virtue grow and expand throughout each and every moment of thought.

source: རིགས་ ཀྱི་ བུ འམ །_ རིགས་ ཀྱི་ བུ་མོ་ གང་ སངས་རྒྱས་ ཀྱི་ ཆོས་ ཡོན་ཏན་ མཐའ་ ཡ ས་ ཤིང་ ཡོན་ཏན་ མུ་མེད་པ །_ སྟོབས་ མཐའ་ ཡ ས་ ཤིང་ སྟོབས་ མུ་མེད་པ་ མཐའ་དག་ ཆུབ་པ་ ཡོངས་སུ་ རྫོགས་པ ར་ འདོད་པ་ དང་ །_ མོས་པ་ དང་ །_ སྨོན་པ་ ལྟ་ སྨོས་ ཀྱང་ ཅི་ དགོས་ ཏེ
en: Such being the case, how much more so will that be the case for the sons or daughters of noble family who seek, wish, and aspire to perfect the mastery#26 of the infinite and boundless qualities and powers of a buddha?

source: བག་མེད་ པར་ གྱུར་ ཏམ །_ གཉིད་ ཀྱིས་ ལོག་ ཀྱང་ རྒྱུ་ བཞི་ དང་ །_ རྐྱེན་ བཞི་ དང་ །_ དམིགས་པ་ བཞི་པོ་ དེ་དག་ ནི་ དེ འི་ དགེ་བ འི་ རྩ་བ འི་ ཕུང་པོ་ མཐའ་ ཡ ས་ ཤིང་ མུ་མེད་པ་ བཞི་ དང་ །_ བྱང་ཆུབ་ ཀྱི་ ཚོགས་ ཀྱི་ ཕུང་པོ་ མཐའ་ ཡ ས་ ཤིང་ མུ་མེད་པ་ བཞི་ སེམས་ ཀྱི་ སྐད་ཅིག་ སེམས་ ཀྱི་ སྐད་ཅིག་ ལ་ འཕེལ་ ཞིང་ རྒྱས་པ ར་ འགྱུར་བ་ སྟེ །_
en: For even when they are careless or asleep, the four causes, four conditions, and four aims will grow and expand in each and every moment of thought into four infinite and boundless heaps of roots of virtue and four infinite and boundless heaps of accumulations conducive to awakening.

source: སེམས་ ཀྱི་ སྐད་ཅིག་ སེམས་ ཀྱི་ སྐད་ཅིག་ ལ་ དགེ་བ འི་ རྩ་བ འི་ ཕུང་པོ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ བཞི་ སྐྱེ་བ་ དང་ །_ རྫོགས་པ འི་ བྱང་ཆུབ་ ཀྱི་ ཚོགས་ ཀྱི་ ཕུང་པོ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ བཞི་ སྐྱེ་བ་ དག་ གིས་ རྫོགས་པ འི་ བྱང་ཆུབ་ རྙེད་པ ར་ མི་ དཀའ་ ན
en: With the emergence in each and every moment of thought of the four infinite heaps of roots of virtue and the four infinite and boundless heaps of accumulations conducive to awakening it will not be difficult to attain awakening.

source: བདག་ གིས་ འདིར་ སེམས་ ཀྱི་ སྐད་ཅིག་ སེམས་ ཀྱི་ སྐད་ཅིག་ ལ་ དགེ་བ འི་ རྩ་བ འི་ [165b] ཕུང་པོ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ བཞི་ དང་ །_ |#| རྫོགས་པ འི་ བྱང་ཆུབ་ ཀྱི་ ཚོགས་ ཀྱི་ ཕུང་པོ་ མཐའ་ ཡ ས་ ཤིང་ མཐའ་ཡས་པ་ བཞི་ ཡང་དག་ པར་ རྗེས་སུ་ མཐོང་ ལ །_
en: Therefore, I shall now tend to the four infinite heaps of roots of virtue [165.b] and |#| the four infinite heaps of accumulations for perfect awakening in each and every moment of thought.

source: གཞི་ དེ་ལས་ རྫོགས་པ འི་ བྱང་ཆུབ་ རྙེད་པ ར་ མི་ དཀའ་བ ར་ ཡང་དག་ པར་ རྗེས་སུ་ མཐོང་ བཞིན་ དུ་ རྫོགས་པ འི་ བྱང་ཆུབ་ འཐོབ་པ ར་ འགྱུར་བ འི་ བརྩོན་འགྲུས་ སྲོག་ གི་ ཕྱིར་ཡང་ ཅིའི་ཕྱིར་ ཉམས་པ ར་ བྱ་ སྙམ་ མོ །_།
en: On that basis, I will ensure that perfect awakening will not be difficult to obtain. In so doing, why would I slacken my diligence, even at the cost of my own life, when it enables me to attain perfect awakening?

source: རྒྱ་མཚོ་ ཆེན་པོ་ བཞི་ ནི་ ཤར་ཕྱོགས་ ཀྱི་ མཐའ་ ཡང་ མངོན་ ཞིང་མུ་ ཡང་ མངོན་ ལ །_
en: $53 “ ‘The four great oceans are evidently finite and limited in the east.

source: ལྷོ་ དང་ །_ ནུབ་ དང་ །_ བྱང་ དང་ །_ འོག་ དང་ །_ སྟེང་ གི་ མཐའ་ ཡང་ མངོན་ ཞིང་མུ་ ཡང་ མངོན་ ལ །_
en: They are obviously finite and limited as well in the south, west, north, nadir, and zenith.

source: དགེ་བ འི་ རྩ་བ་ བྱང་ཆུབ་ ཀྱི་ ཚོགས་ ཀྱི་ རྒྱ་མཚོ་ ཆེན་པོ་ མཐའ་ ཡ ས་ མུ་མེད་པ་ བཞི་པོ་ དེ་དག་ ལ་ ནི་ མཐའ་ དང་ མུ་ ཡོད་པ་ མ་ ཡིན་ ན
en: Yet, the four infinite and boundless great oceans of the accumulations of roots of virtue and factors conducive to awakening have neither end nor limit.

source: བདག་ གིས་ སེམས་ ཀྱི་ སྐད་ཅིག་ སེམས་ ཀྱི་ སྐད་ཅིག་ ལ་ དགེ་བ འི་ རྩ་བ འི་ བྱང་ཆུབ་ ཀྱི་ ཚོགས་ ཀྱི་ རྒྱ་མཚོ་ ཆེན་པོ་ བཞི་པོ་ འདི་དག་ འཕེལ་ ཞིང་ རྒྱས་ ན་ |#| རྫོགས་པ འི་ བྱང་ཆུབ་ འཐོབ་པ ར་ འགྱུར་བ་ ལ་ སྲོག་ གི་ ཕྱིར་ཡང་ ཅིའི་ཕྱིར་ བརྩོན་འགྲུས་ ཉམས་པ ར་ བྱ་ སྙམ་ མོ །_།
en: Thus, given that I will attain perfect awakening once these four great oceans of the accumulations of roots of virtue and factors conducive to awakening have grown and |#| expanded throughout each and every moment of thought, why would I slacken my diligence, even at the cost of my life?’

source: གང་དག་ སེང་གེ་ དང་ །_ སྟག་ དང་ །_ ཁྱི་ དང་ །_ ཅེ་སྤྱང་ དང་ །_ བྱ་རྒོད་ དང་ །_ ཁྲུང་ ཁྲུང་ དང་ །_ བྱ་རོག་ དང་ །_ འུག་པ་ དང་ །_ སྲིན་བུ་ དང་ །_ སྦྲང་མ་ དང་ །_ སྦྲང་བུ་ དང་ །_ ཤ་སྦྲང་ དུ་ གྱུར་པ་ དེ་དག་ གིས་ ཀྱང་ བྱང་ཆུབ་ མངོན་པར་ རྫོགས་པ ར་ སངས་རྒྱས་ པར་ གྱུར་ ན
en: ‘If even lions, tigers, dogs, jackals, vultures, curlews, crows, owls, worms, bees, horseflies, and gadflies can perfectly and completely awaken to buddhahood,

source: བདག་ མིར་ གྱུར་ བཞིན་ དུ་ སྲོག་ གི་ ཕྱིར་ཡང་ ཅིའི་ཕྱིར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཐོབ་པ ར་ འགྱུར་བ འི་ བརྩོན་འགྲུས་ ཉམས་པ ར་ བྱ་ སྙམ་ མོ །_།
en: then as a human being, why should I slacken my diligence, even at the cost of my own life, when it allows me to attain perfect awakening?’

source: མི་ བརྒྱ་ འམ །_ མི་ སྟོང་ གིས་ ཀྱང་ སངས་རྒྱས་ ཉིད་ རྟོགས་ ཤིང་ ཐོབ་ ན་ བདག་ གིས་ ཀྱང་ འདིར་ ཅིའི་ཕྱིར་ མི་ རྟོགས་ ཤིང་ ཐོབ་པ ར་ མི་ འགྱུར །_
en: ‘If even a hundred or a thousand people can realize and attain buddhahood, why should I not also realize and attain buddhahood now?

source: གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ ཀྱི་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ རྣམས་ ཀྱིས་ ཀྱང་ རྟོགས་ ཤིང་ བརྙེས །_
en: Thus-gone ones, worthy ones, perfect buddhas equal in number to the grains of sand in the Ganges River have also realized and attained it.

source: གང་ གཱའི་ ཀླུང་ གི་ བྱེ་མ་ སྙེད་ ཀྱི་ དེ་བཞིན་ གཤེགས་པ་ དགྲ་བཅོམ་པ་ ཡང་དག་ པར་ རྫོགས་པ འི་ སངས་རྒྱས་ རྣམས་ ཀྱང་ རྟོགས་ ཤིང་ བརྙེས་པ ར་ གྱུར་ ན
en: If thus-gone ones, worthy ones, perfect buddhas equal in number to the grains of sand in the Ganges River have realized and attained it, then

source: བདག་ གིས་ འདིར་ སྲོག་ [166a] གི་ ཕྱིར་ཡང་ ཅིའི་ཕྱིར་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཐོབ་པ ར་ འགྱུར་བ འི་ བརྩོན་འགྲུས་ ཉམས་པ ར་ བྱ་ སྙམ་ མོ །_།
en: [166.a] why should I slacken my diligence, even at the cost of my life, when it allows me to attain perfect awakening?’

source: ལག་ བཟངས་ གཞན་ ཡང་ བྱང་ཆུབ་ སེམས་དཔའ་ བརྩོན་འགྲུས་ བརྩམས་པ་ ཡིན་ ཏེ །_
en: $56 “Furthermore, Subāhu, bodhisattvas have applied diligence,

source: སངས་རྒྱས་ སྟོན་པ འོ །_། ཞེས་ སྟོན་ ན་ སངས་རྒྱས་ ཀྱི་ གསུངས་པ འམ །_ ཉན་ཐོས་ ཀྱིས་ བཤད་པ འམ །_ བྱང་ཆུབ་ སེམས་དཔ ས་ བཤད་པ འམ །_ ཐ་ན་ སྨྱོན་པ་ རྣམས་ ཀྱིས་ བཤད་པ འི་ ཆོས་ གང་ཡིན་པ་ དག་ དང་ །_ |#| སྦྱིན་པ འི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_ |#| ཚུལ་ཁྲིམས་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_ |#| བཟོད་པ འི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_ |#| བརྩོན་འགྲུས་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_ |#| བསམ་གཏན་ གྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དང་ །_ |#| ཤེས་རབ་ ཀྱི་ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ཡོངས་སུ་ རྫོགས་པ ར་ འགྱུར་བ་ དང་ །_ |#| སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐོབ་པ ར་ འགྱུར་བ་ དང་ །_ རྫོགས་པ འི་ བྱང་ཆུབ་ ཐོབ་པ ར་ འགྱུར་བ་ དང་ །_ |#| ཐམས་ཅད་ མཁྱེན་པ་ ཉིད་ ཐོབ་པ ར་ འགྱུར་བ འི་ ཆོས་ གང་ཡིན་པ་ དེ་དག་ མགོ་ དང་ གོས་ ལ་ མེ་ འབར་བ་ བཞིན་ དུ་ རྟག་པ ར་ རྒྱུན་ ཏུ་ ཉན་ ཏོ །_། ངེས་པ ར་ བྱེད་ དོ །_། རྟོག་ གོ _།
en: whenever they constantly and perpetually listen to, ascertain, and reflect upon—as though their hair and clothes were on fire— any Dharma teaching that is reported to be a teaching by a buddha, whether it be taught by a buddha, explained by a worthy one, explained by a bodhisattva, or even explained by madmen, as well as any Dharma teaching that leads to the completion of the |#| perfections of generosity, |#| ethical discipline, |#| patience, |#| diligence, |#| concentration, |#| and |#| insight, and |#| that leads to the attainment of the qualities of a buddha, and the attainment of perfect awakening and omniscience.

source: མཁས་པ་ ལེ་ལོ་ མེད་པ་ ནི་ རུ་ ཤིང་ བཞིན་ དུ་ བྱེད་ ཅིང་ ཡིད་ ལ་ བྱེད་པ ས་ མདུང་ཐུང་ དག་ གིས་ བཟློག་ ཀྱང་ དེ་ མགོ་ དང་ གོས་ ལ་ མེ་ འབར་བ་ བཞིན་ དུ་ རྟག་པ ར་ རྒྱུན་ ཏུ་ ཆོས་ དེ་དག་ འཛིན་ ཏོ །_། ཡོངས་སུ་ ཤེས་པ ར་ བྱེད་ དོ །_། འཆད་ དོ །_། ཀློག་ གོ _། རྗེས་སུ་ སེམས་ སོ །_། གཞན་དག་ ལ་ སྟོན་ ཏོ །_། གོ་བ ར་ བྱེད་ དོ །_།
en: $57 “By carefully heeding and keeping in mind the Dharma, the wise and industrious constantly and perpetually receive, master, explain, recite, contemplate, teach, and convey to others those Dharma teachings as if their own hair and clothes were on fire, even if they are turned back with spears.

source: མཁས་པ་ ལེ་ལོ་ མེད་པ་ ནི་ རུ་ ཤིང་ བཞིན་ དུ་ བྱེད་ ཅིང་ ཡིད་ ལ་ བྱེད་པ ས་ མདུང་ཐུང་ དག་ གིས་ བཟློག་ ཀྱང་ རུང་ །_ དེ་ བཅོལ་ ཀྱང་ རུང་ །_ མ་ བཅོལ་ ཡང་ རུང་ །_ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ དོན་ དང་ །_ |#| ཅི་ བྱ་བ་ ཆོས་ཅན་ ཆོས་ དང་ ལྡན་པ །_ |#| འཇིག་རྟེན་ འདི་ ལ་ བདེ་བ འམ །_ |#| འཇིག་རྟེན་ ཕ་རོལ་ ཏུ་ བདེ་བ་ དག་ ལ་ རང་ གི་ ལུས་ ཉེ་བ ར་ སྤྱོད་པ་ དང་ །_ ཡོ་བྱད་ དུ་ གྱུར་པ ར་ བྱེད་ དོ །_།
en: $58 “By carefully heeding and keeping in mind the Dharma, the wise and industrious use their own bodies as instruments in the service of all beings’ welfare and |#| to practice any activity connected with the Dharma#27 for |#| happiness in this and other worlds, |#| whether they are turned back with spears, or whether they have been entrusted with this or not.

source: དཔེར་ན་ འབྱུང་བ་ ཆེན་པོ་ བསྒྲིབས་པ་ མེད་པ །_ ཡོངས་སུ་ གཟུང་བ་ མེད་པ་ བཞི་པོ་ འདི་དག་ ནི་ སེམས་ཅན་ ཐམས་ཅད་ ཀྱི་ ཉེ་བ ར་ སྤྱད་པ་ དང་ །_ ཡོ་བྱད་ དུ་ གྱུར་པ་ རྣམས་ ཡིན་ ནོ །_།
en: Just as the four great elements, unobstructed and unbound, are like instruments in the service of all beings,

source: ལག་ བཟངས་ དེ་བཞིན་ དུ་ བྱང་ཆུབ་ སེམས་དཔའ་ ཡང་ རང་ གི་ ལུས་སེམས་ ཅན་ ཐམས་ཅད་ ཀྱི་ ཉེ་བ ར་ སྤྱད་པ་ དང་ །_ ཡོ་བྱད་ དུ་ གྱུར་པ ར་ བྱེད་ དེ །_
en: likewise, Subāhu, do bodhisattvas use their own bodies as instruments in the service of all beings.

source: སངས་རྒྱས་ དང་ །_ ཆོས་ དང་ །_ དགེ་འདུན་ [166b] དང་ །_ བྱང་ཆུབ་ སེམས་དཔའ་ དང་ །_ སློབ་དཔོན་ དང་ །_ བླ་མ་ དང་ །_ རྒན་པ་ དང་ །_ ནད་པ་ དང་ །_ མགོན་མེད་པ་ རྣམས་ ལ་ ཡོངས་སུ་ སྤྱད་པ ར་ བྱ་བ་ དང་ །_ སྲི་ཞུ་ བྱ་བ་ དང་ །_ བསྙེན་བཀུར་ བྱ་བ ས་ བྱེ་བྲག་ ཏུ་ འགྱུར་ རོ །_།
en: For they are distinguished by venerating the Buddha, Dharma, and Saṅgha; serving bodhisattvas, preceptors, and teachers; and attending upon [166.b] the elderly, sick, and defenseless.

source: དེ་ མགོ་ དང་ གོས་ ལ་ མེ་ འབར་བ་ བཞིན་ དུ་ གཞན་ གྱི་ སེམས་ དང་ གཞན་ གྱི་ སྙིང་ དགའ་བ ར་ འགྱུར་བ འི་ ཚིག་ དང་ །_
en: As if their hair and clothes were on fire, they attract others, inspiring faith in them by being agreeable with them through speech that brings joy to others’ hearts and minds;

source: རྗེས་སུ་ འཐུན་པ་ དང་ །_ འཐུན་ པར་ བྱེད་པ་ དང་ །_
en: by acting in conformity with them;

source: ཡང་དག་ པར་ བགོད་པ་ དང་ །_ གྲོགས་ བྱེད་པ་ དང་ །_ གྲོགས་ སུ་ འགྱུར་བ་ དང་ །_ དགེ་བ་ འཐུན་པ་ དང་ །_ དོན་ འཐུན་ པས་ རྗེས་སུ་ ཞུགས་ ནས་ མངོན་དུ་ དད་པ ར་ བྱས་ ཤིང་ བསྡུས་ ཏེ་
en: by sharing liberally with them, supporting them, and serving as their companions; and by acting in harmony with virtue.

source: ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ ལ་ འོས་པ་ རྣམས་ ནི་ ཉན་ཐོས་ ཀྱི་ ཐེག་པ་ ལ་ འཛུད་ དོ །_། འདུལ་ ལོ །_། འགོད་ དོ །_།
en: $59 “They induct, tame, and establish in the Hearers’ Vehicle those suited to the Hearers’ Vehicle.

source: རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ ལ་ འོས་པ་ རྣམས་ ནི་ རང་ སངས་རྒྱས་ ཀྱི་ ཐེག་པ་ ལ འོ །_།
en: They induct, tame, and establish in the Solitary Buddhas’ Vehicle those suited to the Solitary Buddhas’ Vehicle.

source: རྫོགས་པ འི་ བྱང་ཆུབ་ ཀྱི་ ཐེག་པ་ ལ་ འོས་པ་ རྣམས་ ནི་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཀྱི་ ཐེག་པ་ ལ་ འཛུད་ དོ །_། འདུལ་ ལོ །_། འགོད་ དོ །_།
en: They induct, tame, and establish in the Perfect Awakening Vehicle those suited to the Perfect Awakening Vehicle.

source: མཁས་པ་ ལེ་ལོ་ མེད་པ་ ནི་ མདུང་ཐུང་ དག་ གིས་ བཟློག་ ཀྱང་ མགོ་ དང་ གོས་ ལ་ མེ་ འབར་བ་ བཞིན་ དུ་ དམ་པ འི་ ཆོས་ ཀྱི་ རྒྱུ་ དང་ །_ དམ་པ འི་ ཆོས་ ཀྱི་ ཆེད་ དང་ །_ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དྲུག་ གི་ རྒྱུ་ དང་ །_ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ དྲུག་ གི་ ཆེད་ དང་ །_ དགེ་བ འི་ རྒྱུ་ དང་ །_ དགེ་བ འི་ ཆེད་ ལ་ གྲང་བ་ ཡང་ ཁྱད་ དུ་ གསོད་ ལ །_
en: Even if they are turned back with spears, the wise and industrious act as if their hair and clothes were on fire, disregarding cold for the sake and purpose of the sublime Dharma, for the sake and purpose of the six perfections, and for the sake and purpose of virtue.

source: ཚ་བ་ དང་ །_ བཀྲེས་པ་ དང་ །_ སྐོམ་པ་ དང་ །_ ཤ་སྦྲང་ དང་ །_ སྦྲང་བུ་ དང་ །_ རླུང་ དང་ །_ ཉི་མ་ དང་ །_ སྡིག་སྦྲུལ་ གྱིས་ རེག་པ་ དང་ །_ གཞན་ གྱིས་ ངན་ དུ་ སྨྲས་པ་ དང་ །_ ངན་ དུ་ བརྗོད་པ འི་ ཚིག་ གི་ ལམ་ དང་ །_ ངལ་བ་ དང་ །_ ཉོན་མོངས་པ་ དང་ །_ གཉིད་ དང་ །_ མི་ དགའ་བ་ དང་ །_ ལུས་ དང་ སྲོག་ ཀྱང་ ཁྱད་ དུ་ གསོད་ དོ །_།
en: They also disregard heat, hunger, thirst, gadflies, horseflies, wind, sun, encounters with scorpions and snakes, others’ offensive words, insulting name-calling, leisure, misfortune, sleep, displeasure, their bodies, and their lives.

source: མཁས་པ་ ལེ་ལོ་ མེད་པ་ ནི་ མདུང་ཐུང་ དག་ གིས་ བཟློག་ ཀྱང་ དེ་ རྫོགས་པ འི་ བྱང་ཆུབ་ ཀྱི་ རྒྱུ་ དང་ །_ རྫོགས་པ འི་ བྱང་ཆུབ་ ཀྱི་ ཆེད་ ལ་ ལྷ འི་ སྡུག་བསྔལ་ ཡང་ ཁྱད་ དུ་ གསོད་ དོ །_། |#| ལྷ་མ་ ཡིན་ གྱི་ སྡུག་བསྔལ་ ཡང་ ཁྱད་ དུ་ གསོད་ དོ །_། མི་ ཡི་ སྡུག་བསྔལ་ ཡང་ ཁྱད་ དུ་ གསོད་ དོ །_། ཡི་དགས་ ཀྱི་ སྡུག་བསྔལ་ ཡང་ ཁྱད་ དུ་ གསོད་ དོ །_། |#| དུད་འགྲོ འི་ སྐྱེ་གནས་ ཀྱི་ སྡུག་བསྔལ་ དང་ །_ སེམས་ཅན་ དམྱལ་བ འི་ སྡུག་བསྔལ་ ཡང་ ཁྱད་ དུ་ གསོད་ དོ །_།
en: For the sake and purpose of perfect awakening, the wise and industrious, even if turned back with spears, also disregard the sufferings of gods; |#| the sufferings of asuras, humans, and anguished spirits; |#| and the sufferings of the animal realms and hells.

source: མཁས་པ་ ལེ་ལོ་ མེད་པ་ ནི་ མདུང་ཐུང་ དག་ གིས་ བཟློག་ ཀྱང་ དེ་ མི་མཉམ་པ་ དང་ མཉམ་པ འི་ སངས་རྒྱས་ ཀྱི་ [167a] ཆོས་ ཡོངས་སུ་ བསྐང་བ་ ཐོབ་པ ར་ བྱ་བ་ དང་ །_ སྤྱོད་ལམ་ དང་ །_ ཕ་རོལ་ ཏུ་ ཕྱིན་པ་ ཐམས་ཅད་ ཡོངས་སུ་ རྫོགས་པ་ ཐོབ་པ ར་ བྱ་བ འི་ ཕྱིར་ བརྩོན་འགྲུས་ བརྟན་ ཞིང་ རྟུལ་བ་ བརྟན་ ཏོ །_།
en: The wise and industrious, even if turned back with spears, maintain firm diligence and courage in order to attain the fulfillment of the unequaled qualities of a buddha [167.a] and to attain the completion of all conduct and perfections.

source: དེ འི་ བརྩོན་འགྲུས་ འདི་ དང་ །_ རྟུལ་བ་ འདི་ མངོན་སུམ་ དུ་ བྱ་བ ར་ འདོད་པ་ དང་ །_ བརྩམ་པ ར་ འདོད་པ་ ན་ |#| ཡང་
en: $60 “Should they even just wish to focus on and apply this diligence and courage,

source: སེམས་ཅན་ ཐམས་ཅད་ བསྒྲལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དགྲོལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དབུགས་དབྱུང་བ་ དང་ །_ ཐམས་ཅད་ མཁྱེན་པ་ ཉིད་ ཐོབ་པ ར་ བྱ་བ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ འི་ ཕྱིར་ ཡོངས་སུ་ སྔོ་བ ར་ བྱེད་ དོ །_།
en: they dedicate this so that all beings are ferried across, liberated, and relieved, and so that they may attain omniscience and perfect all the qualities of a buddha.

source: མངོན་སུམ་ དུ་ བྱེད་པ་ དང་ །_ རྩོམ་པ་ དང་ །_ མངོན་སུམ་ དུ་ བྱས་པ་ དང་ །_ བརྩམས་ ནས་ ཀྱང་ སེམས་ཅན་ ཐམས་ཅད་ བསྒྲལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དགྲོལ་བ་ དང་ །_ སེམས་ཅན་ ཐམས་ཅད་ དབུགས་དབྱུང་བ་ དང་ །_ ཐམས་ཅད་ མཁྱེན་པ་ ཉིད་ ཐོབ་པ ར་ བྱ་བ་ དང་ །_ སངས་རྒྱས་ ཀྱི་ ཆོས་ ཐམས་ཅད་ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ འི་ ཕྱིར་ ཡོངས་སུ་ སྔོ་བ ར་ བྱེད་ དོ །_།
en: While focusing upon and applying diligence and courage, and again after having done so, they dedicate this so that all beings are ferried across, liberated, and relieved, and so that they may attain omniscience and perfect all the qualities of a buddha.

source: གལ་ཏེ་ བརྩོན་འགྲུས་ འདི་ མ་ ཉམས་པ་ དང་ །_ སྐྱོན་མེད་པ་ དང་ །_ འདྲེན་མ་ མ་ཡིན་པ ར་ སློབ་པ འི་ ནུས་པ་ དང་ མི་ ལྡན་པ ར་ གྱུར་ ན །_ དེ་ འདི་ལྟར་ ཡང་དག་ པར་ སློབ་ སྟེ །_
en: $61 “Should they lack the capacity to be unwavering, flawless, and uncorrupted in training in this diligence, bodhisattvas train as follows:

source: དུས་ དུས་ སུ འམ །_ ཅུང་ཟད་ ཅུང་ཟད་ དུ་ ཡང་ སྙོམ་ལས་ དང་ །_ ལེ་ལོ་ སྤོང་བ་ དང་ །_ དོར་བ་ དང་ །_ བསལ་བ ར་ རྩོལ་ ལོ །_། འབད་ དོ །_།
en: From time to time, or little by little, they strive and exert themselves in abandoning, forsaking, and eliminating indolence and laziness.

source: དུས་ དུས་ སུ འམ །_ ཅུང་ཟད་ ཅུང་ཟད་ དུ་ ཡང་ བརྩོན་འགྲུས་ དང་ །_ རྟུལ་བ་ ལ་ སློབ་པ་ དང་ །_ མངོན་པར་ འཕེལ་བ ར་ བྱ་བ་ དང་ །_ ཡོངས་སུ་ རྫོགས་པ ར་ བྱ་བ ར་ རྩོལ་ ལོ །_། འབད་ དོ །_།
en: From time to time, or little by little, they also strive and exert themselves in training, developing, and perfecting diligence and courage.
